wang521258/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE ---
# ★ 本分支(koi-firmware)整体关闭无线栈，理由见 main/main.c 顶部：
#   ESP32-C3 无 PSRAM，DRAM 只有 ~320KB，而锦鲤池要一块 240x320 RGB565
#   全屏帧缓冲 = 153,600 B。开着无线栈直接链接失败（实测溢出 146,800 B）。
#   光是把 wifi/ble 的 demo 从 main.c 里摘掉还不够 —— ESP-IDF 的
#   .esp_system_init_fn 段是 KEEP 的，会把注册了系统初始化的归档成员一并拉进来，
#   所以这里必须从 Kconfig 层面彻底关掉，链接结果才可预期。
#   要恢复上游 AI Passport 功能：把 CONFIG_BT_ENABLED 改回 y，
#   并把原厂 8MB 整片备份刷回去。
CONFIG_BT_ENABLED=n
